In [1]:
import pandas as pd

In [2]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                        {'Name': 'Sally', 'Role': 'Course Liason', 'Location': 'Washington Ave'},
                        {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Ave'}])
staff_df

    Name            Role        Location
0  Kelly  Director of HR    State Street
1  Sally   Course Liason  Washington Ave
2  James          Grader  Washington Ave

In [3]:
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Ave'},
                        {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                        {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
student_df

    Name       School              Location
0  James     Business     1024 Billiard Ave
1   Mike          Law  Fraternity House #22
2  Sally  Engineering   512 Wilson Crescent

## For staff, location is their office building. For students, it is their home address.
## Merge will preserve the data, appending _x and _y to indicate which DF the data came from.

In [4]:
pd.merge(staff_df, student_df, how='left', on='Name')

    Name            Role      Location_x       School           Location_y
0  Kelly  Director of HR    State Street          NaN                  NaN
1  Sally   Course Liason  Washington Ave  Engineering  512 Wilson Crescent
2  James          Grader  Washington Ave     Business    1024 Billiard Ave

## here is multi-level merging

In [5]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Green', 'Role': 'Director of HR'},
                        {'First Name': 'Sally', 'Last Name': 'Ride', 'Role': 'Course Liason'},
                        {'First Name': 'James', 'Last Name': 'Kirk', 'Role': 'Grader'}])
staff_df

  First Name Last Name            Role
0      Kelly     Green  Director of HR
1      Sally      Ride   Course Liason
2      James      Kirk          Grader

In [6]:
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Etta', 'School': 'Business'},
                        {'First Name': 'Mike', 'Last Name': 'Hammer', 'School': 'Law'},
                        {'First Name': 'Sally', 'Last Name': 'Ride', 'School': 'Engineering'}])
student_df

  First Name Last Name       School
0      James      Etta     Business
1       Mike    Hammer          Law
2      Sally      Ride  Engineering

In [7]:
pd.merge(staff_df, student_df, how='inner', on=['First Name', 'Last Name'])

  First Name Last Name           Role       School
0      Sally      Ride  Course Liason  Engineering